Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignCode Class
 The AnalysisDesignCode class contains information related to analysis design codes.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisDesignCode
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisDesignCode
Public NotInheritable Class AnalysisDesignCode
The AnalysisDesignCode type exposes the following members.
Constructors
Name | Description
AnalysisDesignCode
Initializes a new instance of the AnalysisDesignCode class
Top
Properties
Name | Description
DesignParameters
 Gets or sets the design parameters of the analysis design code.
ID
 Gets or sets the identifier of the analysis design code.
MaterialType
 Gets the material type of the analysis analysis design code.
Name
 Gets the name of the analysis design code.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace